In [ ]:
##practice Problem_1
import pandas as pd
lst = [10, 20, 30, 40, 50]
series = pd.Series(lst)
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [12]:
dct = {'Name':["Marwan","Najim","Masum","Angkon"],"Age":[20,24,26,25],"City":["Sylhet","Moulovibazar","Saidpur","Mymenshingh"]}
df = pd.DataFrame(dct)
print(df)

     Name  Age          City
0  Marwan   20        Sylhet
1   Najim   24  Moulovibazar
2   Masum   26       Saidpur
3  Angkon   25   Mymenshingh

In [ ]:
##Practice Problem 2
movies = pd.read_csv("movies.csv")
rows,columns = movies.shape
print("In The Dataset Movies")
print("Number of Rows:",rows,"Number of Columns:",columns)
print("Column Data Type:\n",movies.dtypes)

In The Dataset Movies
Number of Rows: 1629 Number of Columns: 18
Column Data Type:
 title_x              object
imdb_id              object
poster_path          object
wiki_link            object
title_y              object
original_title       object
is_adult              int64
year_of_release       int64
runtime              object
genres               object
imdb_rating         float64
imdb_votes            int64
story                object
summary              object
tagline              object
actors               object
wins_nominations     object
release_date         object
dtype: object
Summary Stats:
        is_adult  year_of_release  imdb_rating     imdb_votes
count    1629.0      1629.000000  1629.000000    1629.000000
mean        0.0      2010.263966     5.557459    5384.263352
std         0.0         5.381542     1.567609   14552.103231
min         0.0      2001.000000     0.000000       0.000000
25%         0.0      2005.000000     4.400000     233.000000
50%         0.0      2011.000000     5.600000    1000.000000
75%         0.0      2015.000000     6.800000    4287.000000
max         0.0      2019.000000     9.400000  310481.000000

In [35]:
print("Summary Stats:\n",movies.describe()[["imdb_rating","imdb_votes"]])

Summary Stats:
        imdb_rating     imdb_votes
count  1629.000000    1629.000000
mean      5.557459    5384.263352
std       1.567609   14552.103231
min       0.000000       0.000000
25%       4.400000     233.000000
50%       5.600000    1000.000000
75%       6.800000    4287.000000
max       9.400000  310481.000000

In [50]:
#practice Problem3
data = {
    'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
    'Price': [10, 50, 5, 7],
    'Quantity': [100, 60, 200, 150]
}
df3 = pd.DataFrame(data)
print(df3)
print(df3.columns)
print(df3.index)

  Product  Price  Quantity
0     Pen     10       100
1    Book     50        60
2  Eraser      5       200
3  Pencil      7       150
Index(['Product', 'Price', 'Quantity'], dtype='object')
RangeIndex(start=0, stop=4, step=1)

In [ ]:
print(df3.loc[::,"Price"])
print()
print(df3.loc[1])

0    10
1    50
2     5
3     7
Name: Price, dtype: int64

Product     Book
Price         50
Quantity      60
Name: 1, dtype: object

In [62]:
#practice problem 4
movies.loc[0]

title_x                                      Uri: The Surgical Strike
imdb_id                                                     tt8291224
poster_path         https://upload.wikimedia.org/wikipedia/en/thum...
wiki_link           https://en.wikipedia.org/wiki/Uri:_The_Surgica...
title_y                                      Uri: The Surgical Strike
original_title                               Uri: The Surgical Strike
is_adult                                                            0
year_of_release                                                  2019
runtime                                                           138
genres                                               Action|Drama|War
imdb_rating                                                       8.4
imdb_votes                                                      35112
story               Divided over five chapters  the film chronicle...
summary             Indian army special forces execute a covert op...
tagline                                                           NaN
actors              Vicky Kaushal|Paresh Rawal|Mohit Raina|Yami Ga...
wins_nominations                                               4 wins
release_date                                    11 January 2019 (USA)
Name: 0, dtype: object

In [ ]:
movies.iloc[::,5]

0            Uri: The Surgical Strike
1                       Battalion 609
2       The Accidental Prime Minister
3                     Why Cheat India
4                     Evening Shadows
                    ...
1624            Tera Mera Saath Rahen
1625             Yeh Zindagi Ka Safar
1626                  Sabse Bada Sukh
1627                            Daaka
1628                         Humsafar
Name: original_title, Length: 1629, dtype: object

In [75]:
movies.iloc[5:8,5:8]

  original_title  year_of_release runtime
5           Soni             2018      97
6  Fraud Saiyyan             2019     109
7     Bombairiya             2019     104

In [91]:
lst = {"Name":["Ahem","Modi","Jigar","Dawal"],"Marks":[89,54,98,33],"Age":[43,70,34,30]}
gopi = pd.DataFrame(lst)
gopi = gopi.drop(columns= ["Age"])
gopi.set_index("Name",inplace = True)
gopi

       Marks
Name
Ahem      89
Modi      54
Jigar     98
Dawal     33

In [106]:
#Practice Problem 6
emp = [["Jubayer","Sk","Suman","Nasim","Kamrul"],["Lecturer","Lecturer","Associate Professor","Assistant Professor","Professor"],[50000,50000,65000,800000,100000]]
employee = pd.DataFrame(emp).T
employee.columns = ["Name","Role","Salary"]
employee

      Name                 Role  Salary
0  Jubayer             Lecturer   50000
1       Sk             Lecturer   50000
2    Suman  Associate Professor   65000
3    Nasim  Assistant Professor  800000
4   Kamrul            Professor  100000

In [112]:
#practice Problem_7
students = {"Name":["Marwan","Siam","Ahsan","Akash","Rayhan","Roni","Abrar","Mahin"],"Score":[99,95,80,92,97,89,93,96]}
df7 = pd.DataFrame(students)
df7[(df7["Score"] > 90) & (df7["Score"] < 100)]
# df7

     Name  Score
0  Marwan     99
1    Siam     95
3   Akash     92
4  Rayhan     97
6   Abrar     93
7   Mahin     96